     A*  ORDER HISTORY - SAME LAYOUT AS ORDERS
     A          R ORDHREC
     A            ORDNO          7P 0
     A            CUSTNO         6P 0
     A            AMOUNT         9P 2
     A            ORDDATE        8P 0
     A          K ORDNO
